In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
                  'Name': ['Alex', 'Shannon', 'Jodie', 'Jordan'],
                  'Gender': ['M',np.nan,'F','M'],
                  'Age': ['24','18','32',np.nan]
                })
df

      Name Gender  Age
0     Alex      M   24
1  Shannon    NaN   18
2    Jodie      F   32
3   Jordan      M  NaN

### using any() on entire dataframe

In [3]:
# which columns have at least one Null value across all rows
# gives a Series with column names and an "aggregated" Truth Value based on boolean OR logic
# We see Gender and Age are two columns which has NaN in some row
df.isnull().any(axis = 0)

Name      False
Gender     True
Age        True
dtype: bool

In [4]:
# which rows have at least one Null value across all columns
# gives a Series with row indexes and an "aggregated" Truth Value based on boolean OR logic
# We see Row index 1,3 are some examples which has NaN in some column
df.isnull().any(axis = 1)

0    False
1     True
2    False
3     True
dtype: bool

In [5]:
# Default axis = 0, this is same as df.isnull().any(axis = 0)
df.isnull().any()

Name      False
Gender     True
Age        True
dtype: bool

### using any() on a particular column or a row

In [6]:
# Is there any NaN in column 'Name'?
# any() does not find any NaN's : result = False
df['Name'].isnull().any()

False

In [7]:
# Is there any NaN in row Index 1?
# Row Index 1 has a NaN in Gender : result = True
df.loc[1].isnull().any()

True

In [16]:
# Why do these throw error? 
# axis = 1 is invalid for any() when operated on a Series : df['Name'].isnull() is a Series

df['Name'].isnull().any(axis = 1)
df.loc[1].isnull().any(axis = 1)

No axis named 1 for object type Series

### Using all() on entire dataframe

In [9]:
# we will use a different data sets this time
df2 = pd.DataFrame({
                  'Name': [np.NaN, np.NaN, np.NaN, np.NaN],
                  'Gender': [np.NaN,'F','F','M'],
                  'Age': [np.NaN,'18','32','34']  
                })
df2

   Name Gender  Age
0   NaN    NaN  NaN
1   NaN      F   18
2   NaN      F   32
3   NaN      M   34

In [10]:
# which columns have all NaN's value across all rows
# gives a Series with column names and an "aggregated" Truth Value based on boolean OR logic
# We see Gender and Age are two columns which has all NaN's
df2.isnull().all(axis = 0)

Name       True
Gender    False
Age       False
dtype: bool

In [11]:
# which rows have all NaN's across all columns
# gives a Series with row indexes and an "aggregated" Truth Value based on boolean OR logic
# We see Row index 0 has all NaN's
df2.isnull().all(axis = 1)

0     True
1    False
2    False
3    False
dtype: bool

### Using all() on a specific column

In [12]:
# Does the column 'Name' have all NaN's
# Yes, Name has all NaNs
df2['Name'].isnull().all()

True

In [13]:
# Does the row with index 0 have all NaN's
# Yes, row index 0 has all NaN's
df2.loc[0].isnull().all()

True

In [17]:
# Again, axis = 1 is invalid for all() when operated on a Series and df2['Name'].isnull() is a Series
df2['Name'].isnull().all(axis = 1)

No axis named 1 for object type Series